do

function run(msg, matches)
  return ''..[[
⚙ لیست دستورات ابزار ها:

ماشین حساب ⬅️ حساب [ارقام]

توجه حتما عدد ها به انگیلیسی باشند
دستورات ماشین حساب: 

(+)این یعنی جمع 

(-)این یعنی تفریق 

(*)این یعنی ضرب کردن

(/)این یعنی تقسیم کردن

تکرار متن مورد نظر شما ⬅️ بگو [متن]

سرچ کلن ⬅️ /clash [تگ]

سرچ در آپارات ⬅️ /aparat [موضوع]

دریافت اوقات شرعی ⬅️ /azan [شهر]

تبدیل متن به صدا ⬅️ !voice [متن انگیلیسی]

ساخت عکس نوشته ⬅️ تبدیل [متن انگیلیسی]

جست و جو در گوگل ⬅️ گوگل [متن]

سرچ در اینستاگرام ⬅️ [نام] /insta

ساخت استیکر ⬅️ [متن][سایز]!sticker

دریافت آب و هوا ⬅️ [شهر] weather

نمایش محیط یک وبسایت ⬅️ سایت [آدرس Https]

برای دریافت ساعت ⬅️ زمان [کشور یا شهر]

مشاهده نقشه ⬅️ نقشه [کشور یا شهر]

ساختن عکس نوشته سگی ⬅️ سگ [متن انگیلیسی]

دریافت  qr ⬅️ Qr code [ متن]

دریافت اخبار هکری ⬅️ اخبار هک
—------------------------------—
● TeleAgent Bot ● ]]
end

return {
  description = "Robot and Creator About", 
  usage = "/help : robot info",
  patterns = {
    "^[!/][Tt][Oo][Oo][Ll][Ss]$",
    "^[Tt][Oo][Oo][Ll][Ss]$",
    "^[!/]tools$",
    "^tools$",
    "^ابزار ها"
  }, 
  run = run 
}

end
