do

function run(msg, matches)
  return ''..[[
ابزار های ربات ●
—-
> ماشین حساب ⬅️ حساب [ارقام]
—-
> توجه حتما عدد ها به انگیلیسی باشند ⚙
دستورات ماشین حساب: 
(+) این یعنی جمع 

(-) این یعنی تفریق 

(*) این یعنی ضرب کردن

(/) این یعنی تقسیم کردن
—-
> تکرار متن مورد نظر شما ⬅️ بگو [متن]
—-
> سرچ کلن ⬅️ [تگ کلن] clash/
—-
> سرچ در آپارات ⬅️ [موضوع] aparat/
—-
> دریافت اوقات شرعی ⬅️ [شهر] azan/
—-
> تبدیل متن به صدا ⬅️ [متن انگیلیسی] voice!
—-
> ساخت عکس نوشته ⬅️ تبدیل [متن انگیلیسی]
—-
> جست و جو در گوگل ⬅️ گوگل [متن]
—-
> سرچ در اینستاگرام ⬅️ [نام] insta/
—-
> ساخت استیکر ⬅️ [متن] [سایز] sticker/
—-
> دریافت آب و هوا ⬅️ [شهر] weather
—-
> برای دریافت ساعت ⬅️ زمان [کشور یا شهر]
—-
> مشاهده نقشه ⬅️ نقشه [کشور یا شهر]
—-
> ساختن عکس نوشته سگی ⬅️ سگ [متن انگیلیسی]
—-
> دریافت  qr ⬅️ Qr code [ متن]
—-
> دریافت اخبار هکری ⬅️ اخبار هک
—-
> دریافت زمان فعلی ⬅️ time/
—-
> دریافت آهنگ ⬅️[نام موزیک] music/
—-
> دانلود آهنگ⬅️ [شماره آهنگ] dl/
—-

—------------------------------—
@TeleAgentTeam ]]
end

return {
  description = "Robot tools", 
  usage = "/tools : robot tools",
  patterns = {
    "^[!/][Tt][Oo][Oo][Ll][Ss]$",
    "^[Tt][Oo][Oo][Ll][Ss]$",
    "^[!/]tools$",
    "^tools$"
  }, 
  run = run 
}

end
